from datetime import date

menu = {
    0: {
        "breakfast": ["Каша овсяная", "Чай / какао", "Яблоко"],
        "lunch": {
            "льготный": ["Борщ", "Наггетсы", "Картофель", "Чай / компот"],
            "платный": ["Наггетсы", "Квас"]
        }
    },
    1: {
        "breakfast": ["Оладьи", "Джем", "Какао"],
        "lunch": {
            "льготный": ["Суп куриный", "Котлета", "Рис", "Компот"],
            "платный": ["Котлета", "Mорс"]
        }
    },
    2: {
        "breakfast": ["Запеканка", "Сгущенка", "Чай"],
        "lunch": {
            "льготный": ["Щи", "Гуляш", "Гречка", "Чай"],
            "платный": ["Гуляш", "Сок"]
        }
    },
    3: {
        "breakfast": ["Сырники", "Сметана", "Какао"],
        "lunch": {
            "льготный": ["Уха", "Рыбная котлета", "Пюре", "Компот"],
            "платный": ["Рыбная котлета", "Чай"]
        }
    },
    4: {
        "breakfast": ["Блинчики", "Фруктовое пюре", "Чай"],
        "lunch": {
            "льготный": ["Рассольник", "Плов", "Салат", "Компот"],
            "платный": ["Плов", "Морс"]
        }
    },
}


breakfast = ["Чай / какао", "Фруктовое пюре", "Оладьи", "Квас"]
lunch = {
    "льготный": ["Борщ", "Наггетсы", "Картофель", "Чай / компот", "Свекла / морковь"],
    "платный": ["Наггетсы", "Квас"]
}
lunch_type = "льготный"


class DiningMenu:
    def __init__(self, breakfast: list, lunch: dict):
        self.breakfast = breakfast.copy()
        self.lunch = lunch.copy()

    @classmethod
    def from_weekday(cls, day=None):
        if day is None:
            day = date.today().weekday()
        ### Здесь будет обращение к таблице
        return DiningMenu(menu[day]["breakfast"], menu[day]["lunch"])
